In [2]:
import pandas as pd
data1 = pd.Series([10,5,2,2,7], index = ['철수','영희','민수','칠성','펩시'])
data1.index.name = '이름'
data1

이름
철수    10
영희     5
민수     2
칠성     2
펩시     7
dtype: int64

In [4]:
data1['철수']

10

In [12]:
data1.loc['철수']

10

In [13]:
data1.iloc[0]

10

In [31]:
a = ['민수','펩시']
data1[a]

이름
민수    2
펩시    7
dtype: int64

In [28]:
b = [2,4]
data1.iloc[b]

이름
민수    2
펩시    7
dtype: int64

In [34]:
data1.index

Index(['철수', '영희', '민수', '칠성', '펩시'], dtype='object', name='이름')

In [35]:
data1.values

array([10,  5,  2,  2,  7], dtype=int64)

In [42]:
sorted(data1) #동일한 코드 = sorted(data1.values)

[2, 2, 5, 7, 10]

In [43]:
sorted(data1.index)

['민수', '영희', '철수', '칠성', '펩시']

In [48]:
data1.reindex(['펩시','칠성','민수','영희','철수'])

이름
펩시     7
칠성     2
민수     2
영희     5
철수    10
dtype: int64

In [49]:
data1.reindex(sorted(data1.index))

이름
민수     2
영희     5
철수    10
칠성     2
펩시     7
dtype: int64

In [52]:
data2 = pd.Series([1,3,1,5,2], index=['영희','민수','철수','펩시','코카'])
data1 + data2

민수     5.0
영희     6.0
철수    11.0
칠성     NaN
코카     NaN
펩시    12.0
dtype: float64

In [53]:
data1.unique()

array([10,  5,  2,  7], dtype=int64)

In [58]:
win = {'금메달' : 10, '은메달' : 3, '동메달' : 12}
data3 = pd.Series(win)
data3

금메달    10
은메달     3
동메달    12
dtype: int64

In [4]:
profile = {'age' : [23,41,62,9], 'name' : ['벤','광수','재석','종국'], 'height' : [152,190,178,185]}
data4 = pd.DataFrame ( profile, columns = ['name','age','height'])
data4

  name  age  height
0    벤   23     152
1   광수   41     190
2   재석   62     178
3   종국    9     185

In [6]:
data4.iloc[1:3]

  name  age  height
1   광수   41     190
2   재석   62     178

In [9]:
data4.iloc[:,1:3]

   age  height
0   23     152
1   41     190
2   62     178
3    9     185

In [17]:
data4.loc[[1,2]] #index가 0,1,2,3 이기에 여기도 숫자

  name  age  height
1   광수   41     190
2   재석   62     178

In [23]:
data4.loc[:,['name','age']] #각자 넣으려면 반드시 쉼표와 리스트괄호, 연속된거 넣으려면 : 이걸로 연결

  name  age
0    벤   23
1   광수   41
2   재석   62
3   종국    9

In [24]:
data4.head(3)

  name  age  height
0    벤   23     152
1   광수   41     190
2   재석   62     178

In [25]:
data4.tail(2)

  name  age  height
2   재석   62     178
3   종국    9     185

In [27]:
lon = [False, True, True,False]
data4[lon]

  name  age  height
1   광수   41     190
2   재석   62     178

In [29]:
data4.age[lon]

1    41
2    62
Name: age, dtype: int64

In [31]:
data4.mean

<bound method NDFrame._add_numeric_operations.<locals>.mean of   name  age  height
0    벤   23     152
1   광수   41     190
2   재석   62     178
3   종국    9     185>

In [34]:
data4.mean(axis=0)

age        33.75
height    176.25
dtype: float64

In [39]:
data4.height.astype(float)

0    152.0
1    190.0
2    178.0
3    185.0
Name: height, dtype: float64